DIM A AS BYTE
DIM A_old AS BYTE
DIM X AS BYTE
DIM Y AS BYTE
DIM 보행순서 AS BYTE
'**** 기울기센서포트 설정

CONST 앞뒤기울기AD포트 = 2
CONST 좌우기울기AD포트 = 3

'*****  2012년 이전 센서 ****
'CONST 기울기확인시간 = 10  'ms
'CONST min = 100         '뒤로넘어졌을때
'CONST max = 160         '앞으로넘어졌을때
'CONST COUNT_MAX = 30
'

'**** 2012년 사용 센서 *****

'*******************

'*******모터방향설정*********************
DIR G6A,1,0,0,1,0,0   '왼쪽다리:모터0~5번
DIR G6D,0,1,1,0,1,0   '오른쪽다리:모터18~23번
DIR G6B,1,1,1,1,1,1   '왼쪽팔:모터6~11번
DIR G6C,0,0,0,0,0,0   '오른쪽팔:모터12~17번


'*******모터동시제어설정****************
PTP SETON       '단위그룹별 점대점동작 설정
PTP ALLON      '전체모터 점대점 동작 설정

'*******모터위치값피드백****************
GOSUB MOTOR_GET

'*******모터사용설정********************
MOTOR G24

'***** 초기자세로 **********************
SPEED 5
GOSUB 기본자세


보행순서 = 1
'***** 메인 반복루틴 **************
MAIN:

    ERX 4800,A,MAIN
    A_old = A

    IF A = 1 THEN
		GOTO 앞으로덤블링
	ENDIF
	
    GOTO MAIN
    
앞으로덤블링:
	
	SPEED 15
	MOVE G6B, 190, 100, 100
	MOVE G6C, 190, 100, 100
	WAIT
	
	SPEED 12
	MOVE G6B, 190, 10, 100
	MOVE G6C, 190, 10, 100
	WAIT
	
	'SPEED 12
    'MOVE G6A, 100,  76, 145,  93, 100, 100
    'MOVE G6D, 100,  76, 145,  93, 100, 100
    'MOVE G6B, 190,  10,  100
    'MOVE G6C, 190,  10,  100
    'WAIT
	
	SPEED 12
    MOVE G6A, 100,  76, 145,  130, 100, 100
    MOVE G6D, 100,  76, 145,  130, 100, 100
    MOVE G6B, 190,  10,  80 , 100, 100
    MOVE G6C, 190,  10,  80 , 100, 170
    WAIT
	
	
	SPEED 12
    MOVE G6A,100, 77, 145, 40, 100, 100
    MOVE G6D,100, 77, 145, 130, 100, 100
    MOVE G6B, 170,  20,  85
    MOVE G6C, 170,  20,  85
    WAIT
	
    'SPEED 15
    'MOVE G6A,100, 77, 170, 170, 100, 100
    'MOVE G6D,100, 77, 170, 170, 100, 100
    'MOVE G6B,170,  20,  85
    'MOVE G6C,170,  20,  85
    'WAIT

    SPEED 15
    MOVE G6A,100,  56, 110,  26, 100, 100
    MOVE G6D,100,  71, 177, 162, 100, 100
    MOVE G6B,170,  40,  70
    MOVE G6C,170,  40,  70
    WAIT

    SPEED 15
    MOVE G6A,100,  60, 110,  15, 100, 100
    MOVE G6D,100,  70, 120, 30, 100, 100
    MOVE G6B,170,  40,  70
    MOVE G6C,170,  40,  70
    WAIT

    SPEED 15
    MOVE G6A,100,  60, 110,  15, 100, 100
    MOVE G6D,100,  60, 110,  15, 100, 100
    MOVE G6B,190,  40,  70
    MOVE G6C,190,  40,  70
    WAIT
    DELAY 50

    SPEED 15
    MOVE G6A,100, 110, 70,  65, 100, 100
    MOVE G6D,100, 110, 70,  65, 100, 100
    MOVE G6B,190, 160, 115
    MOVE G6C,190, 160, 115
    WAIT

    SPEED 10
    MOVE G6A,100, 170,  70,  15, 100, 100
    MOVE G6D,100, 170,  70,  15, 100, 100
    MOVE G6B,190, 155, 120
    MOVE G6C,190, 155, 120
    WAIT
 
 	SPEED 10
    MOVE G6A,100, 170,  30,  110, 100, 100
    MOVE G6D,100, 170,  30,  110, 100, 100
    MOVE G6B,190,  40,  60
    MOVE G6C,190,  40,  60
    WAIT
    '여기 아래에서 엎어짐'
    SPEED 10
    MOVE G6A,100, 170,  65,  110, 100, 100
    MOVE G6D,100, 170,  65,  110, 100, 100
    MOVE G6B,190,  32,  70
    MOVE G6C,190,  32,  70
    WAIT
    '------------------------------------
    '---------앞으로 일어나기------------
    
    SPEED 10
    MOVE G6A, 60, 162,  30, 162, 145, 100
    MOVE G6D, 60, 162,  30, 162, 145, 100
    MOVE G6B,170,  10, 100, 100, 100, 100
    MOVE G6C,170,  10, 100, 100, 100, 100
    WAIT
    
    MOVE G6A, 60, 150,  28, 155, 140, 100
    MOVE G6D, 60, 150,  28, 155, 140, 100
    MOVE G6B,150,  60,  90, 100, 100, 100
    MOVE G6C,150,  60,  90, 100, 100, 100
    WAIT
    '''''''''''''''''''''''''
  
    '---------------'추가분'-----------------
    MOVE G6A,100, 150,  28, 140, 100, 100
    MOVE G6D,100, 150,  28, 140, 100, 100
    MOVE G6B,130,  50,  85, 100, 100, 100
    MOVE G6C,130,  50,  85, 100, 100, 100
    WAIT
    DELAY 100

	SPEED 10
	MOVE G6A,100, 150,  33, 140, 100, 100
    MOVE G6D,100, 150,  33, 140, 100, 100
    WAIT
    


    'SPEED 13
    'GOSUB 앉은자세
	
	'-------------어정쩡한 자세---------------
	'SPEED 10
	'MOVE G6A,100,  125, 92,  92, 100, 100
    'MOVE G6D,100,  125, 92,  92, 100, 100
    ' 
    ' MOVE G6B,100,  30,  80, 100, 100, 100
    ' MOVE G6C,100,  30,  80, 100, 100, 100
    ' WAIT
    ' '----------------------------------------
    
    SPEED 10
    GOSUB 기본자세

    GOTO MAIN

기본자세:
    MOVE G6A,100,  76, 145,  93, 100, 100
    MOVE G6D,100,  76, 145,  93, 100, 100
    MOVE G6B,100,  30,  80, 100, 100, 100
    MOVE G6C,100,  30,  80, 100, 100, 100
    WAIT
    
    RETURN
    
앉은자세:

    MOVE G6A,100, 143,  28, 142, 100, 100
    MOVE G6D,100, 143,  28, 142, 100, 100
    MOVE G6B,100,  30,  80
    MOVE G6C,100,  30,  80
    WAIT

    RETURN
    
    
MOTOR_GET: '위치값피드백
    GETMOTORSET G6A,1,1,1,1,1,0
    GETMOTORSET G6B,1,1,1,0,0,1
    GETMOTORSET G6C,1,1,1,0,0,0
    GETMOTORSET G6D,1,1,1,1,1,0
    RETURN